Enums/ТипыОценочныхОбязательств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыОценочныхОбязательств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОценочныеОбязательстваПоВознаграждениям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценочныеОбязательстваПоСтраховымВзносам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценочныеОбязательстваПоВзносамФССНСиПЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценочныеОбязательстваПоСО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценочныеОбязательстваПоСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценочныеОбязательстваПоОППВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценочныеОбязательстваПоООСМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценочныеОбязательстваПоОПВР</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыОценочныхОбязательств/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;

	СписокИсключаемыхЗначение = Новый СписокЗначений;
	СписокИсключаемыхЗначение.Добавить(Перечисления.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоСтраховымВзносам);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоВзносамФССНСиПЗ);
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Для Индекс = 0 по Перечисления.ТипыОценочныхОбязательств.Количество()-1 Цикл
		ТекущееЗначение = Перечисления.ТипыОценочныхОбязательств.Получить(Индекс);
		Если СписокИсключаемыхЗначение.НайтиПоЗначению(ТекущееЗначение) = Неопределено Тогда
			ДанныеВыбора.Добавить(ТекущееЗначение);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецЕсли
